positionmap = {
    'baoan_xia': (15, 26),
    '保安区': (15, 26),
    '当前位置':(-1,-1),
    'sanhuo_you': (10, 12),
    '散货区1': (10, 12),
    'sanhuo_zuo': (5, 12),
    '散货区2': (5, 12),
    'sanhuo_xia': (8, 9),
    '散货区3': (8, 9),
    'lingjian_shang': (17, 17),
    '零件区1': (17, 17),
    'lingjian_xia': (17, 14),
    '零件区2': (17, 14),
    'lingjian_zuo': (15, 16),
    '零件区3': (15, 16),

    'gongwei1': (15, 7),
    '工位1': (15, 7),

    'gongwei2': (17, 7),
    '工位2': (17, 7),

    'huojia1': (2, 10),
    '货架1': (2, 10),

    'huojia2': (2, 11),
    '货架2': (2, 11),

    'xiuxi1': (14, 20),
    '休息区1': (14, 20),

    'xiuxi2': (12, 20),
    '休息区2': (12, 20),
    "men":(19,29),
    "门":(19,29)
    }

objmap={"白色方块":"cube_white"}